#+TITLE: Gensim Tutorials

*** 向量化处理

1. 使用 =bag-of-words= 模型表示文档 (也可以使用其他表示方式)

   #+BEGIN_QUOTE
   使用 =bag-of-words= 模型时，每篇文档都由一个向量表示，相应向量中，每个元素表示一个 “问答对”，形式
   如下：
    "文档中相应词汇出现多少次? 1次。"
   #+END_QUOTE

2. 将文档转换为向量

   =gensim= 可以将所有文档处理为词典， =gensim= 会遍历所有文档中所有的词汇，并给每个词汇唯一的标记
    
    #+BEGIN_SRC python
 from gensim import corpora
 dictionary = corpora.Dictionary(texts)
 dictionary.save("/tmp/deerwester.dict") # store the dictionary, for future reference
 print(dictionary)
    #+END_SRC

    #+RESULTS:
    : 2019-08-03 12:28:49,819 : INFO : adding document #0 to Dictionary(0 unique tokens: [])
    : 2019-08-03 12:28:49,819 : INFO : built Dictionary(12 unique tokens: ['computer', 'human', 'interface', 'response', 'survey']...) from 9 documents (total 29 corpus positions)
    : <gensim.corpora.dictionary.Dictionary object at 0x1a15a64470>

    #+BEGIN_SRC python
print(dictionary.token2id)
    #+END_SRC

    #+RESULTS:
    : {'computer': 0,
    :  'human': 1,
    :  'interface': 2,
    :  'response': 3,
    :  'survey': 4,
    :  'system': 5,
    :  'time': 6,
    :  'user': 7,
    :  'eps': 8,
    :  'trees': 9,
    :  'graph': 10,
    :  'minors': 11}

3. 测试

   - 下面的示例中， "interaction" 在词袋模型中没有出现， "human" 出现了一次， "computer" 出现了两次，
     因此输出为 [(0, 2), (1, 1)], 表示 0 对应的 "computer" 出现了 2 次， 1 对应的 "human" 出现了 1
     次.

     #+BEGIN_SRC python
new_doc = "Human computer computer interaction"
new_vec = dictionary.doc2bow(new_doc.lower().split())
print(new_vec)
     #+END_SRC

     #+RESULTS:
     : [(0, 3), (1, 1)]

   - 处理所有文档

     #+BEGIN_SRC python
corpus = [dictionary.doc2bow(text) for text in texts]
corpora.MmCorpus.serialize("/tmp/deerwester.mm", corpus) # store to disk, for later use
print(corpus)
     #+END_SRC

